{
    "name": "Nicolas Escandon",
    "logo_name": "NEV117",
    "role": "Back-end Developer.",
    "about": {
        "sections": {
            "professional-info": {
                "title": "professional-info",
                "icon": "icons/info-professional.svg",
                "info": {
                    "experience": {
                        "title": "experience",
                        "description": "<br>My experience is a blend of university projects and independent endeavors. Additionally, over the past few months, I have been working as a full-stack developer at a local company in my city, contributing to the creation of a web application aimed at enhancing the management of an agricultural products manufacturing company, specializing in oils and fats."
                    },
                    "hard-skills": {
                        "title": "hard-skills",
                        "description": "<br>As a developer, I am embracing a dynamic phase of versatility that enables me to actively contribute to project development, whether it's on the resilient backend or the engaging frontend. While I hold a particular affinity and leaning towards backend development and services, I have laid a solid groundwork in logic, algorithms, data structures, and conscientious coding practices, which I believe add depth to my capabilities. <br> <br> Furthermore, I bring valuable experience to the table, having previously served as a full-stack developer on an Angular + .NET project within the industry. This exposure has not only sharpened my technical prowess but has also honed my ability to navigate the intricacies of cross-disciplinary collaboration."
                    },
                    "soft-skills": {
                        "title": "soft-skills",
                        "description": "<br>Beyond my technical expertise, my soft skills play a crucial role in my development journey. I approach challenges with curiosity and a hunger for learning, ensuring continuous improvement. Strong communication skills facilitate collaboration and effective problem-solving, while adaptability allows me to embrace new technologies and methods. <br><br> I value feedback, actively seek mentorship, and contribute positively to team dynamics. Empathy and understanding help me connect with diverse stakeholders, ensuring solutions are not only technically sound but also aligned with real-world needs. My blend of technical proficiency and soft skills enables me to deliver results and cultivate a collaborative and inclusive development environment."
                    }
                }
            },
            "personal-info": {
                "title": "personal-info",
                "icon": "icons/info-personal.svg",
                "info": { 
                    "bio": {
                        "title": "bio",
                        "description": "<br> Hello there! I'm a 20-year-old enthusiast currently in my final year of computer engineering in Cali, Colombia. With a growing passion for coding and a dash of real-world experience under my belt, I'm eagerly stepping into the tech arena. <br><br> Throughout my academic journey, I've been unwavering in my pursuit of knowledge and my dedication to refining my programming skills. While I may be on the junior side of the developer spectrum, what I lack in years, I make up for with an insatiable curiosity and an eagerness to dive into new challenges. <br><br> Remote work as a developer is my goal, as it perfectly aligns with my flexible mindset and the chance to collaborate with diverse teams. I've already had the opportunity to work on a few projects, which has fueled my determination to learn and contribute even more. Now, I'm excited to channel that energy into a dynamic junior role, soaking up every learning opportunity and actively contributing to innovative projects. <br><br> Joining a forward-thinking team that values growth and creativity is my next step, and I'm thrilled to embark on this journey as a junior developer. Let's connect and explore the possibilities together!"
                    },
                    "interests": {
                        "title": "interests",
                        "description": "<br>My passion lies at the intersection of data and its manipulation. From the intricacies of databases to the seamless integration of APIs, I find the world of data enthralling. The challenge of crafting logical processes and efficient algorithms to extract meaningful insights from raw information captivates me. Data's ability to tell stories and drive informed decisions has motivated me to delve deep into this realm, enhancing my skills to unlock its true potential. <br><br> I'm captivated by the realm of artificial intelligence (AI). The notion of creating systems that mimic human intelligence, enabling machines to learn, reason, and solve complex problems, fascinates me. From machine learning to neural networks, I'm engrossed in the myriad applications that AI offers across industries. I relish the challenge of developing intelligent algorithms that adapt and evolve, and I'm committed to staying abreast of AI's rapid evolution, eager to contribute to its ever-expanding possibilities. <br><br> Data science and business intelligence have emerged as my dual passions. The art of unraveling patterns, predicting trends, and making data-driven decisions within the realm of data science is something I've actively cultivated. Simultaneously, I'm intrigued by the strategic insights that business intelligence offers – harnessing data to empower enterprises to make informed choices that drive growth. The convergence of these fields offers endless opportunities to contribute meaningfully and drive innovation in today's data-centric landscape. "
                    },
                    "education": {
                        "title": "education",
                        "description": "<br>I'm on the cusp of completing my Computer Engineering degree at Universidad Autónoma de Occidente in Cali, Colombia. My academic journey has molded me into a versatile developer with a strong foundation in both technical and interpersonal skills. <br><br> My education spans the spectrum, covering everything from programming logic and algorithms to networks, operating systems, and cybersecurity. This diverse knowledge equips me to create efficient solutions and ensure robustness in any project. <br><br> Beyond technical prowess, my teamwork, project formulation, and communication skills are finely tuned. I'm primed to collaborate seamlessly with diverse teams, adapting to various roles. <br><br> As I approach the professional realm, I'm excited to leverage this comprehensive education. My goal is to contribute effectively as a backend developer, though I'm also open to front-end or other roles that align with my adaptable skill set.   "
                    }
                }
            },
            "hobbies-info": {
                "title": "hobbies-info",
                "icon": "icons/info-hobbies.svg",
                "info": {
                    "sports": {
                        "title": "strength-beyond-software_Weightlifting",
                        "description": "<br>Beyond my coding endeavors, I find solace and strength in weightlifting. For the past 5 years, the gym has been my sanctuary, where lifting weights brings discipline and focus to my life. <br><br> Weightlifting isn't just a hobby; it's a lifestyle that complements my dedication to software development. It teaches me persistence and fuels my determination. <br><br> My commitment to weightlifting is as enduring as my passion for coding. It's a lifelong pursuit that mirrors my desire for constant growth. <br><br> In weights and code, I discover harmony between physical and mental prowess. This dual pursuit defines my balanced approach to success."
                    }
                }
            }
        }
    },
    "contacts": {
        "direct": {
            "title": "contacts",
            "sources": {
                "email": "nicoescandonvarela123<br>@gmail.com",
                "phone": "+57 3104615959"
            }
        },
        "social": {
            "github": {
                "title": "Github profile",
                "url": "https://github.com/",
                "user": "NEV117"
            },
            "facebook": {
                "title": "Facebook profile",
                "url": "https://facebook.com/",
                "user": "username"
            },
            "twitter": {
                "title": "Twitter account",
                "url": "https://twitter.com/",
                "user": "username"
            }
        }
    },
    "gists": {
        "1": "4ed0d622b7d425dbfa9a27a640a41fdc",
        "2": "3bd1c8c06533eae569a1d7557c93b309"
    },
    "projects": {
        "1": {
            "title": "_java-money-conversor",
            "description": " Proyecto echo para el Challenge ONE Back End - Java",
            "img": "/images/projects/AluraConversorMoneda_Trim (1).gif",
            "tech": ["Java"],
            "url": "https://github.com/NEV117/JavaConversorMonedas"
        },
        "2": {
            "title": "_css-cube",
            "description": "Simple Color Chaging cube mande only using HTML and CSS",
            "img": "/images/projects/css cube.png",
            "tech": ["CSS", "HTML"],
            "url": "https://github.com/NEV117/cubo-en-css"
        },
        "3": {
            "title": "_Simple-encriptator",
            "description": "A Text encriptator that codes and decodes base on simple rules",
            "img": "/images/projects/simpleTextEncriptor.png",
            "tech": ["CSS", "HTML"],
            "url": "https://github.com/NEV117/Encriptador"
        },
        "4": {
            "title": "_ui-animations",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/ui-animations.png",
            "tech": ["React"],
            "url": "https://github.com/"
        },
        "5": {
            "title": "_tetris-game",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/tetris-game.png",
            "tech": ["React"],
            "url": "https://github.com/"
        },
        "6": {
            "title": "_ethereum",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/ethereum.png",
            "tech": ["Vue"],
            "url": "https://github.com/"
        }
    }
}